const conomy = [
  {'label': 'Публичное акционерное общество «Ижсталь», ПАО «Ижсталь», IGST, IGSTP', 'value': '/emitent/izhstal'},
  {'label': 'Открытое акционерное общество «Белон», ОАО «Белон», BLNG', 'value': '/emitent/belon'},
  {'label': 'Публичное акционерное общество «АВТОВАЗ», ПАО «АВТОВАЗ», AVAZP, AVAZ', 'value': '/emitent/avtovaz'},
  {'label': 'Публичное акционерное общество «ВТОРРЕСУРСЫ», ПАО «ВТОРРЕСУРСЫ», VTRS', 'value': '/emitent/vtorresursy'},
  {
    'label': 'Публичное акционерное общество «Владимирская энергосбытовая компания», ПАО «Владимирэнергосбыт», VDSB',
    'value': '/emitent/vladimirenergosbyt',
  },
  {
    'label': 'Публичное акционерное общество «Новолипецкий металлургический комбинат», ПАО «НЛМК», NLMK',
    'value': '/emitent/nlmk',
  },
  {
    'label': 'Публичное акционерное общество «Косогорский металлургический завод», ПАО «КМЗ», KMTZ',
    'value': '/emitent/kmz-2',
  },
  {
    'label': 'Публичное акционерное общество «Галс-Девелопмент», ПАО «Галс-Девелопмент», HALS',
    'value': '/emitent/gals-development',
  },
  {'label': 'Публичное акционерное общество «Газпром», ПАО «Газпром», GAZP', 'value': '/emitent/gazprom'},
  {'label': 'Открытое акционерное общество «ГАЗКОН», ОАО «ГАЗКОН», GAZC', 'value': '/emitent/gazkon'},
  {'label': 'Публичное акционерное общество «ГАЗ», ПАО «ГАЗ», GAZA, GAZAP', 'value': '/emitent/gaz'},
  {
    'label': 'Публичное акционерное общество «Выборгский судостроительный завод», ПАО «ВСЗ», VSYDP, VSYD',
    'value': '/emitent/vsz',
  },
  {'label': 'Публичное акционерное общество «Владимирский химический завод», ПАО «ВХЗ», VLHZ', 'value': '/emitent/vhz'},
  {
    'label': 'Публичное акционерное общество «Волгоградэнергосбыт», ПАО «Волгоградэнергосбыт», VGSBP, VGSB',
    'value': '/emitent/volgogradenergosbyt',
  },
  {
    'label': 'Публичное акционерное общество «Варьеганнефтегаз», ПАО «Варьеганнефтегаз», VJGZ, VJGZP',
    'value': '/emitent/vareganneftegaz',
  },
  {'label': 'Публичное акционерное общество «Бурятзолото», ПАО «Бурятзолото», BRZL', 'value': '/emitent/buryatzoloto'},
  {
    'label': 'Публичное акционерное общество «Башинформсвязь», ПАО «Башинформсвязь», BISV, BISVP',
    'value': '/emitent/bashinformsvyaz',
  },
  {
    'label': 'ПУБЛИЧНОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО «БАНК „САНКТ-ПЕТЕРБУРГ“», ПАО «Банк „Санкт-Петербург“», BSPB',
    'value': '/emitent/sankt-peterburg',
  },
  {
    'label': 'Публичное акционерное общество «Ашинский металлургический завод», ПАО «Ашинский метзавод», AMEZ',
    'value': '/emitent/ashinskij-metzavod',
  },
  {'label': 'Публичное акционерное общество «АРМАДА», ПАО «АРМАДА», ARMD', 'value': '/emitent/armada'},
  {
    'label': 'Публичное акционерное общество «Аэрофлот — российские авиалинии», ПАО «Аэрофлот», AFLT',
    'value': '/emitent/aeroflot',
  },
  {'label': 'Публичное акционерное общество «Акрон», ПАО «Акрон», AKRN', 'value': '/emitent/akron'},
  {
    'label': 'Публичное акционерное общество «Авиакомпания „ЮТэйр“», ПАО «Авиакомпания „ЮТэйр“», UTAR',
    'value': '/emitent/utair',
  },
  {
    'label': 'Публичное акционерное общество «Аптечная сеть 36,6», ПАО «Аптечная сеть 36,6», APTK',
    'value': '/emitent/aptechnaya-set-366',
  },
  {'label': 'Открытое акционерное общество «GTL», ОАО «GTL», GTLC', 'value': '/emitent/gtl'},
  {
    'label': 'Публичное акционерное общество «Финансовая группа БУДУЩЕЕ», ПАО «ФГ БУДУЩЕЕ», FTRE',
    'value': '/emitent/budushee',
  },
  {
    'label': 'Публичное акционерное общество «Европейская Электротехника», ПАО «Европейская Электротехника», EELT',
    'value': '/emitent/euro-eltec',
  },
  {
    'label': 'Публичное акционерное общество Банк «Возрождение», Банк «Возрождение» (ПАО), VZRZ, VZRZP',
    'value': '/emitent/vozrozhdenie',
  },
  {
    'label': 'Публичное акционерное общество «Бест Эффортс Банк», ПАО «Бест Эффортс Банк», ALBK',
    'value': '/emitent/best-efforts-bank',
  },
  {
    'label': 'Акционерная компания «АЛРОСА» (публичное акционерное общество), АК «АЛРОСА» (ПАО), ALRS',
    'value': '/emitent/alrosa',
  },
  {'label': 'Публичное акционерное общество «Завод имени И.А. Лихачева», АМО ЗИЛ, ZILL', 'value': '/emitent/zil'},
  {
    'label': 'Публичное акционерное общество «Абрау – Дюрсо», ПАО «Абрау – Дюрсо», ABRD',
    'value': '/emitent/abrau-durso',
  },
  {'label': 'КИВИ ПиЭлСи (QIWI PLC), КИВИ (QIWI), QIWI', 'value': '/emitent/kartochka-kompanii-qiwi'},
  {'label': 'X5 Retail Group N.V., X5 Retail Group, FIVE', 'value': '/emitent/five-retail-group'},
  {
    'label': 'Публичное акционерное общество «АСКО-СТРАХОВАНИЕ», ПАО «АСКО-СТРАХОВАНИЕ», ACKO',
    'value': '/emitent/skyuzhural-asko',
  },
  {'label': 'Raven Property Group, Raven Property Group, RAVN', 'value': '/emitent/raven_property_group'},
  {
    'label': 'Публичное акционерное общество «Дагестанская энергосбытовая компания», ПАО «Дагестанская энергосбытовая компания», DASB',
    'value': '/emitent/dagestanskaya-energosbytovaya-kompaniya',
  },
  {
    'label': 'Публичное акционерное общество «Газпром нефть», ПАО «Газпром нефть», SIBN',
    'value': '/emitent/gazprom-neft',
  },
  {
    'label': 'Публичное акционерное общество «Научно-производственная корпорация „Иркут“», ПАО «Корпорация „Иркут“», IRKT',
    'value': '/emitent/irkut',
  },
  {'label': 'Публичное акционерное общество «Русолово», ПАО «Русолово», ROLO', 'value': '/emitent/rusolovo'},
  {'label': 'РОС АГРО ПЛС, РОС АГРО ПЛС, AGRO', 'value': '/emitent/ros-agro-plc'},
  {
    'label': 'Публичное акционерное общество «ИНВЕСТИЦИОННАЯ КОМПАНИЯ ИК РУСС-ИНВЕСТ», ПАО «ИК РУСС-ИНВЕСТ», RUSI',
    'value': '/emitent/russ-invest',
  },
  {'label': 'Публичное акционерное общество «МОСТОТРЕСТ», ПАО «МОСТОТРЕСТ», MSTT', 'value': '/emitent/mostotrest'},
  {'label': 'Публичное акционерное общество «Интер РАО ЕЭС», ПАО «Интер РАО», IRAO', 'value': '/emitent/inter-rao-ees'},
  {'label': 'Публичное акционерное общество «М.видео», ПАО «М.видео», MVID', 'value': '/emitent/mvideo'},
  {
    'label': 'Публичное акционерное общество Завод экологической техники и экопитания «ДИОД», ПАО «ДИОД», DIOD',
    'value': '/emitent/diod',
  },
  {'label': '«Лента Лтд» (Lenta Ltd), «Лента Лтд», LNTA', 'value': '/emitent/lenta'},
  {'label': 'Публичное акционерное общество «КАМАЗ», ПАО «КАМАЗ», KMAZ', 'value': '/emitent/kamaz'},
  {
    'label': 'Казанское публичное акционерное общество «Органический синтез», ПАО «Казаньоргсинтез», KZOS, KZOSP',
    'value': '/emitent/kazanorgsintez',
  },
  {
    'label': 'Публичное акционерное общество «Калужская сбытовая компания», ПАО «Калужская сбытовая компания», KLSB',
    'value': '/emitent/kaluzhskaya-sbytovaya-kompaniya',
  },
  {
    'label': 'Публичное акционерное общество «Институт Стволовых Клеток Человека», ПАО «ИСКЧ», ISKJ',
    'value': '/emitent/iskch',
  },
  {'label': 'United Company RUSAL Plc, United Company RUSAL Plc, RUAL', 'value': '/emitent/rusal-plc'},
  {
    'label': 'Публичное акционерное общество «Квадра – Генерирующая компания», ПАО «Квадра», TGKD, TGKDP',
    'value': '/emitent/kvadra',
  },
  {'label': 'Публичное акционерное общество «ЗВЕЗДА», ПАО «ЗВЕЗДА», ZVEZ', 'value': '/emitent/zvezda'},
  {
    'label': 'Публичное акционерное общество «Дальневосточное морское пароходство», ПАО «ДВМП», FESH',
    'value': '/emitent/dvmp',
  },
  {
    'label': 'Открытое акционерное общество «Донской завод радиодеталей», ОАО «ДЗРД», DZRD, DZRDP',
    'value': '/emitent/dzrd',
  },
  {
    'label': 'Публичное акционерное общество «Группа Черкизово», ПАО «Группа Черкизово», GCHE',
    'value': '/emitent/gruppa-cherkizovo',
  },
  {'label': 'Публичное акционерное общество «Группа ЛСР», ПАО «Группа ЛСР», LSRG', 'value': '/emitent/gruppa-lsr'},
  {
    'label': 'Публичное акционерное общество «Дальневосточная энергетическая компания», ПАО «ДЭК», DVEC',
    'value': '/emitent/dek',
  },
  {'label': 'Публичное акционерное общество «Морион», ПАО «Морион», MORI', 'value': '/emitent/morion'},
  {
    'label': 'Публичное акционерное общество «Красноярскэнергосбыт», ПАО «Красноярскэнергосбыт», KRSBP, KRSB',
    'value': '/emitent/krasnoyarskenergosbyt',
  },
  {
    'label': 'Публичное акционерное общество «Южно-Уральский никелевый комбинат», ПАО «Комбинат Южуралникель», UNKL',
    'value': '/emitent/yuzhuralnikel',
  },
  {'label': 'Публичное акционерное общество «МегаФон», ПАО «МегаФон», MFON', 'value': '/emitent/megafon'},
  {
    'label': 'Публичное акционерное общество «Первый инвестиционный фонд МЕРИДИАН», ПАО «МЕРИДИАН», MERF',
    'value': '/emitent/meridian',
  },
  {
    'label': 'Публичное акционерное общество «Медиахолдинг», ПАО «Медиахолдинг», ODVA',
    'value': '/emitent/mediaholding',
  },
  {
    'label': 'Публичное акционерное общество энергетики и электрификации «Магаданэнерго», ПАО «Магаданэнерго», MAGEP, MAGE',
    'value': '/emitent/magadanenergo',
  },
  {
    'label': 'Публичное акционерное общество «Магнитогорский металлургический комбинат», ПАО «ММК», MAGN',
    'value': '/emitent/mmk',
  },
  {
    'label': 'Публичное акционерное общество «ТНС энерго Кубань», ПАО «ТНС энерго Кубань», KBSB',
    'value': '/emitent/kubanenergosbyt',
  },
  {
    'label': 'Публичное акционерное общество «Павловский автобус», ПАО «Павловский автобус», PAZA',
    'value': '/emitent/pavlovskij-avtobus',
  },
  {
    'label': 'Публичное акционерное общество «Объединенные Кредитные Системы», ПАО «ОКС», UCSS',
    'value': '/emitent/oks',
  },
  {
    'label': 'Публичное акционерное общество «Межрегиональная распределительная сетевая компания Центра», ПАО «МРСК Центра», MRKC',
    'value': '/emitent/mrsk-centra',
  },
  {
    'label': 'Публичное акционерное общество «ТНС энерго Марий Эл», ПАО «ТНС энерго Марий Эл», MISBP, MISB',
    'value': '/emitent/tns-energo-marij-el',
  },
  {'label': 'Публичное акционерное общество «Мечел», ПАО «Мечел», MTLR, MTLRP', 'value': '/emitent/mechel'},
  {'label': 'Публичное акционерное общество «Магнит», ПАО «Магнит», MGNT', 'value': '/emitent/magnit'},
  {
    'label': 'Публичное акционерное общество энергетики и электрификации «Мосэнерго», ПАО «Мосэнерго», MSNG',
    'value': '/emitent/mosenergo',
  },
  {
    'label': 'Публичное акционерное общество «Нефтяная компания „ЛУКОЙЛ“», ПАО «ЛУКОЙЛ», LKOH',
    'value': '/emitent/lukoil',
  },
  {
    'label': 'Открытое акционерное общество «Липецкая энергосбытовая компания», ОАО «ЛЭСК», LPSB',
    'value': '/emitent/lesk',
  },
  {'label': 'Открытое акционерное общество «Левенгук», ОАО «Левенгук», LVHK', 'value': '/emitent/levenguk'},
  {
    'label': 'Публичное акционерное общество «Курганская генерирующая компания», ПАО «КГК», KGKCP, KGKC',
    'value': '/emitent/kurganskaya-generiruyushchaya-kompaniya',
  },
  {
    'label': 'Публичное акционерное общество энергетики и электрификации «Ленэнерго», ПАО «Ленэнерго», LSNG, LSNGP',
    'value': '/emitent/lenenergo',
  },
  {
    'label': 'Открытое акционерное общество «Каменск-Уральский завод по обработке цветных металлов», ОАО «КУЗОЦМ», KUNF',
    'value': '/emitent/kuzocm',
  },
  {
    'label': 'Публичное акционерное общество энергетики и электрификации Кубани, ПАО «Кубаньэнерго», KUBE',
    'value': '/emitent/kubanenergo',
  },
  {
    'label': 'Публичное акционерное общество «Русская Аквакультура», ПАО «Русская Аквакультура», AQUA',
    'value': '/emitent/russkaya-akvakultura',
  },
  {
    'label': 'Публичное акционерное общество «Нефтяная компания „Роснефть“», ПАО «НК „Роснефть“», ROSN',
    'value': '/emitent/rosneft',
  },
  {'label': 'Публичное акционерное общество «Северо-Западное пароходство», ПАО «СЗП», SZPR', 'value': '/emitent/szp'},
  {'label': 'Публичное акционерное общество «Плазмек», ПАО «Плазмек», PLSM', 'value': '/emitent/plazmek'},
  {
    'label': 'Публичное акционерное общество «Мобильные ТелеСистемы», ПАО «МТС», ПАО «Мобильные ТелеСистемы», MTSS',
    'value': '/emitent/mts-mobilnye-telesistemy',
  },
  {
    'label': 'Публичное акционерное общество «Нижнекамскшина», ПАО «Нижнекамскшина», NKSH',
    'value': '/emitent/nizhnekamskshina',
  },
  {'label': 'Публичное акционерное общество «Селигдар», ПАО «Селигдар», SELG, SELGP', 'value': '/emitent/seligdar'},
  {'label': 'Публичное акционерное общество «Тантал», ПАО «Тантал», TANL, TANLP', 'value': '/emitent/tantal'},
  {
    'label': 'Публичное акционерное общество «Ставропольэнергосбыт», ПАО «Ставропольэнергосбыт», STSB, STSBP',
    'value': '/emitent/stavropolenergosbyt',
  },
  {'label': 'Открытое акционерное общество «Соликамский магниевый завод», ОАО «СМЗ», MGNZ', 'value': '/emitent/smz'},
  {
    'label': 'Открытое акционерное общество «Славнефть-Ярославнефтеоргсинтез», ОАО «Славнефть-ЯНОС», JNOS, JNOSP',
    'value': '/emitent/slavneft-yanos',
  },
  {'label': 'Публичное акционерное общество «Наука-Связь», ПАО «Наука-Связь», NSVZ', 'value': '/emitent/nauka-svyaz'},
  {'label': 'Публичное акционерное общество «Северсталь», ПАО «Северсталь», CHMF', 'value': '/emitent/severstal'},
  {'label': 'Публичное акционерное общество «Русполимет», ПАО «Русполимет», RUSP', 'value': '/emitent/ruspolimet'},
  {
    'label': 'Публичное акционерное общество «Объединенная авиастроительная корпорация», ПАО «ОАК», UNAC',
    'value': '/emitent/oak',
  },
  {
    'label': 'Публичное акционерное общество «ТНС энерго Нижний Новгород», ПАО «ТНС энерго НН», NNSBP, NNSB',
    'value': '/emitent/tns-energo-nn',
  },
  {
    'label': 'Публичное акционерное общество «Новороссийский морской торговый порт», ПАО «НМТП», NMTP',
    'value': '/emitent/nmtp',
  },
  {
    'label': 'Публичное Акционерное Общество «Нижнекамскнефтехим», ПАО «Нижнекамскнефтехим», NKNC, NKNCP',
    'value': '/emitent/nizhnekamskneftehim',
  },
  {'label': 'Публичное акционерное общество «Нефтекамский автозавод», ПАО «НЕФАЗ», NFAZ', 'value': '/emitent/nefaz'},
  {
    'label': 'Публичное акционерное общество Объединенные машиностроительные заводы (Группа Уралмаш-Ижора), ПАО ОМЗ, OMZZ, OMZZP',
    'value': '/emitent/omz',
  },
  {
    'label': 'Публичное акционерное общество «Московская кондитерская фабрика „Красный Октябрь“», ПАО «Красный Октябрь», KROTP, KROT',
    'value': '/emitent/krasnyj-oktyabr',
  },
  {
    'label': 'Открытое акционерное общество «Мультисистема», ОАО «Мультисистема», MSST',
    'value': '/emitent/multisistema',
  },
  {'label': 'Публичное акционерное общество «НОВАТЭК», ПАО «НОВАТЭК», NVTK', 'value': '/emitent/novatek'},
  {
    'label': 'Публичное акционерное общество «Межрегиональная распределительная сетевая компания Юга», ПАО «МРСК Юга», MRKY',
    'value': '/emitent/mrsk-yuga',
  },
  {
    'label': 'Публичное акционерное общество «Межрегиональная распределительная сетевая компания Центра и Приволжья», ПАО «МРСК Центра и Приволжья», MRKP',
    'value': '/emitent/mrsk-centra-i-privolzya',
  },
  {
    'label': 'Открытое акционерное общество «Межрегиональная распределительная сетевая компания Урала», ОАО «МРСК Урала», MRKU',
    'value': '/emitent/mrsk-urala',
  },
  {
    'label': 'Публичное акционерное общество «Межрегиональная распределительная сетевая компания Сибири», ПАО «МРСК Сибири», MRKS',
    'value': '/emitent/mrsk-sibiri',
  },
  {
    'label': 'Публичное акционерное общество «Межрегиональная распределительная сетевая компания Волги», ПАО «МРСК Волги», MRKV',
    'value': '/emitent/mrsk-volgi',
  },
  {'label': 'Публичное акционерное общество «ИНГРАД», ПАО «ИНГРАД», OPIN', 'value': '/emitent/opin'},
  {'label': 'Публичное акционерное общество «Уралкалий», ПАО «Уралкалий», URKA', 'value': '/emitent/uralkalij'},
  {
    'label': 'Публичное акционерное общество «Саратовэнерго», ПАО «Саратовэнерго», SARE, SAREP',
    'value': '/emitent/saratovenergo',
  },
  {
    'label': 'Публичное акционерное общество «Угольная компания „Южный Кузбасс“», ПАО «Южный Кузбасс», UKUZ',
    'value': '/emitent/yuzhnyj-kuzbass',
  },
  {'label': 'Открытое акционерное общество «Электроцинк», ОАО «Электроцинк», ELTZ', 'value': '/emitent/elektrocink'},
  {'label': 'Публичное акционерное общество «Юнипро», ПАО «Юнипро» , UPRO', 'value': '/emitent/unipro'},
  {
    'label': 'Публичное акционерное общество «Центр международной торговли», ПАО «ЦМТ», WTCM, WTCMP',
    'value': '/emitent/cmt',
  },
  {'label': 'Публичное акционерное общество «БАНК УРАЛСИБ», ПАО «БАНК УРАЛСИБ», USBN', 'value': '/emitent/uralsib'},
  {'label': 'Публичное акционерное общество «Уральская кузница», ПАО «Уралкуз» , URKZ', 'value': '/emitent/uralkuz'},
  {
    'label': 'Публичное акционерное общество «САФМАР Финансовые инвестиции», ПАО «САФМАР Финансовые инвестиции», SFIN',
    'value': '/emitent/safmar',
  },
  {
    'label': 'Публичное акционерное общество «Томская распределительная компания», ПАО «ТРК», TORSP, TORS',
    'value': '/emitent/trk',
  },
  {'label': 'Открытое акционерное Общество «Таганрогский комбайновый завод», ОАО «ТКЗ», TGKO', 'value': '/emitent/tkz'},
  {
    'label': 'Публичное акционерное общество Страховая Компания «Росгосстрах», ПАО СК «Росгосстрах», RGSS',
    'value': '/emitent/rosgosstrah',
  },
  {'label': 'Публичное акционерное общество «ФосАгро», ПАО «ФосАгро», PHOR', 'value': '/emitent/fosagro'},
  {'label': 'Публичное акционерное общество «СОЛЛЕРС», ПАО «СОЛЛЕРС», SVAV', 'value': '/emitent/sollers'},
  {
    'label': 'Публичное акционерное общество «Сбербанк России», ПАО Сбербанк, SBERP, SBER',
    'value': '/emitent/sberbank-rossii',
  },
  {
    'label': 'Публичное акционерное общество «Рязанская энергетическая сбытовая компания», ПАО «РЭСК», RZSB',
    'value': '/emitent/resk',
  },
  {
    'label': 'Публичное акционерное общество «Русгрэйн Холдинг», ПАО «Русгрэйн Холдинг», RUGR',
    'value': '/emitent/rusgrehjn-holding',
  },
  {
    'label': 'Публичное акционерное общество «Российские сети», ПАО «Россети», RSTIP, RSTI',
    'value': '/emitent/rosseti',
  },
  {
    'label': 'Публичное акционерное общество «РОСИНТЕР РЕСТОРАНТС ХОЛДИНГ», ПАО «РОСИНТЕР РЕСТОРАНТС ХОЛДИНГ», ROST',
    'value': '/emitent/rosinter-restorants-holding',
  },
  {
    'label': 'Публичное акционерное общество междугородной и международной электрической связи «Ростелеком», ПАО «Ростелеком», RTKM, RTKMP',
    'value': '/emitent/rostelekom',
  },
  {'label': 'Публичное акционерное общество «РБК», ПАО «РБК», RBCM', 'value': '/emitent/rbk'},
  {
    'label': 'Публичное акционерное общество «Челябинский трубопрокатный завод», ПАО «ЧТПЗ», CHEP',
    'value': '/emitent/chtpz',
  },
  {
    'label': 'Публичное акционерное общество «Челябэнергосбыт», ПАО «Челябэнергосбыт», CLSB, CLSBP',
    'value': '/emitent/chelyabenergosbyt',
  },
  {'label': 'Публичное акционерное общество РОСБАНК, ПАО РОСБАНК, ROSB', 'value': '/emitent/rosbank'},
  {
    'label': 'Публичное акционерное общество «Тучковский комбинат строительных материалов», ПАО «Тучковский КСМ», TUCH',
    'value': '/emitent/tuchkovskij-ksm',
  },
  {
    'label': 'Публичное акционерное общество «Якутскэнерго», ПАО «Якутскэнерго», YKEN, YKENP',
    'value': '/emitent/yakutskenergo',
  },
  {
    'label': 'Открытое акционерное общество «Территориальная генерирующая компания №2», ОАО «ТГК-2», TGKBP, TGKB',
    'value': '/emitent/tgk-2',
  },
  {
    'label': 'Публичное акционерное общество «ТНС энерго Ярославль», ПАО «ТНС энерго Ярославль», YRSB, YRSBP',
    'value': '/emitent/tns-energo-yaroslavl',
  },
  {'label': 'Публичное акционерное общество «Распадская», ПАО «Распадская», RASP', 'value': '/emitent/raspadskaya'},
  {
    'label': 'Публичное акционерное общество «Ракетно-космическая корпорация „Энергия“ имени С.П. Королёва», ПАО «РКК „Энергия“», RKKE',
    'value': '/emitent/rkk-energiya',
  },
  {
    'label': 'Публичное акционерное общество «Туймазинский завод автобетоновозов», ПАО «ТЗА», TUZA',
    'value': '/emitent/tza',
  },
  {'label': 'Публичное акционерное общество «ПРОТЕК», ПАО «ПРОТЕК», PRTK', 'value': '/emitent/protek'},
  {'label': 'Публичное акционерное общество «Энел Россия», ПАО «Энел Россия», ENRU', 'value': '/emitent/enel-rossiya'},
  {
    'label': 'Публичное акционерное общество «Челябинский металлургический комбинат», ПАО «ЧМК», CHMK',
    'value': '/emitent/chmk',
  },
  {
    'label': 'Публичное акционерное общество «Челябинский кузнечно-прессовый завод», ПАО «ЧКПЗ», CHKZ',
    'value': '/emitent/chkpz',
  },
  {
    'label': 'Публичное акционерное общество «Челябинский завод профилированного стального настила», ПАО «ЧЗПСН-Профнастил», PRFN',
    'value': '/emitent/chzpsn-profnastil',
  },
  {
    'label': 'Публичное акционерное общество «Центральный телеграф», ПАО «Центральный телеграф», CNTLP, CNTL',
    'value': '/emitent/centralnyj-telegraf',
  },
  {'label': 'Публичное акционерное общество «Химпром», ПАО «Химпром», HIMC, HIMCP', 'value': '/emitent/himprom'},
  {
    'label': 'Публичное акционерное общество Научно-производственное объединение «Наука», ПАО НПО «Наука», NAUK',
    'value': '/emitent/nauka',
  },
  {
    'label': 'Публичное акционерное общество «Центр по перевозке грузов в контейнерах „ТрансКонтейнер“», ПАО «ТрансКонтейнер», TRCN',
    'value': '/emitent/transkontejner',
  },
  {
    'label': 'Публичное акционерное общество «Трубная Металлургическая Компания», ПАО «ТМК», TRMK',
    'value': '/emitent/tmk',
  },
  {
    'label': 'Публичное акционерное общество «ТНС энерго Ростов-на-Дону», ПАО «ТНС энерго Ростов-на-Дону» , RTSBP, RTSB',
    'value': '/emitent/tns-energo-rostov-na-donu',
  },
  {
    'label': 'Публичное акционерное общество «Мурманская ТЭЦ», ПАО «Мурманская ТЭЦ», MUGS, MUGSP',
    'value': '/emitent/murmanskaya-tec',
  },
  {
    'label': 'Публичное акционерное общество «Территориальная генерирующая компания №14», ПАО «ТГК-14», TGKN',
    'value': '/emitent/tgk-14',
  },
  {
    'label': 'Открытое акционерное общество «Славнефть-Мегионнефтегаз», ОАО «СН-МНГ», MFGS, MFGSP',
    'value': '/emitent/sn-mng',
  },
  {
    'label': 'Публичное акционерное общество энергетики и электрификации «Самараэнерго», ПАО «Самараэнерго», SAGO, SAGOP',
    'value': '/emitent/samaraenergo',
  },
  {
    'label': 'Публичное акционерное общество «Московская объединенная электросетевая компания», ПАО «Московская объединенная электросетевая компания», ПАО «МОЭСК», MSRS',
    'value': '/emitent/moskovskaya-obedinennaya-elektrosetevaya-kompaniya-moesk',
  },
  {
    'label': 'Публичное акционерное общество «Управляющая компания „Арсагера“», ПАО «УК „Арсагера“», ARSA',
    'value': '/emitent/arsagera',
  },
  {'label': 'Банк ВТБ (публичное акционерное общество), Банк ВТБ (ПАО), VTBR', 'value': '/emitent/vtb'},
  {
    'label': 'Публичное акционерное общество МОСКОВСКИЙ ОБЛАСТНОЙ БАНК, ПАО МОСОБЛБАНК, MOBB',
    'value': '/emitent/mosoblbank',
  },
  {
    'label': 'Публичная компания с ограниченной ответственностью Яндекс Н.В. (Public Limited Liability Company Yandex N. V.), Яндекс Н.В. (Yandex N. V.), YNDX',
    'value': '/emitent/yandeks',
  },
  {
    'label': 'Открытое акционерное общество «Таганрогский котлостроительный завод „Красный котельщик“», ОАО ТКЗ «Красный котельщик», KRKO, KRKOP',
    'value': '/emitent/tkz-krasnyj-kotelshchik',
  },
  {
    'label': 'Открытое акционерное общество Медиа группа «Война и Мир», ОАО Медиа группа «Война и Мир», MGVM',
    'value': '/emitent/vojna-i-mir',
  },
  {
    'label': 'Публичное акционерное общество «Группа Компаний „Роллман“», ПАО «ГК „Роллман“», RLMN, RLMNP',
    'value': '/emitent/rollman',
  },
  {
    'label': 'Публичное акционерное общество «Акционерная финансовая корпорация „Система“», ПАО АФК «Система», AFKS',
    'value': '/emitent/sistema',
  },
  {
    'label': 'Публичное акционерное общество Банк «Кузнецкий», ПАО Банк «Кузнецкий», KUZB',
    'value': '/emitent/kuzneckij',
  },
  {
    'label': 'Публичное акционерное общество «Коршуновский горно-обогатительный комбинат», ПАО «Коршуновский ГОК», KOGK',
    'value': '/emitent/korshunov-gok',
  },
  {
    'label': 'Публичное акционерное общество «Акционерная нефтяная Компания „Башнефть“», ПАО АНК «Башнефть» , BANEP, BANE',
    'value': '/emitent/bashneft',
  },
  {
    'label': '«Российский акционерный коммерческий дорожный банк» (публичное акционерное общество), ПАО «РосДорБанк», RDRB',
    'value': '/emitent/rosdorbank',
  },
  {'label': 'Публичное акционерное общество «Таттелеком», ПАО «Таттелеком», TTLK', 'value': '/emitent/tattelekom'},
  {
    'label': 'Публичное акционерное общество «Пермская энергосбытовая компания», ПАО «Пермэнергосбыт», PMSBP, PMSB',
    'value': '/emitent/permenergosbyt',
  },
  {
    'label': 'Публичное акционерное общество энергетики и электрификации «Камчатскэнерго», ПАО «Камчатскэнерго», KCHE, KCHEP',
    'value': '/emitent/kamchatskenergo',
  },
  {
    'label': 'Публичное акционерное общество «Мордовская энергосбытовая компания», ПАО «Мордовская энергосбытовая компания», ПАО «Мордовэнергосбыт», MRSB',
    'value': '/emitent/mordovenergosbyt',
  },
  {
    'label': 'Ленское золотодобывающее публичное акционерное общество «Лензолото», ПАО «Лензолото», LNZLP, LNZL',
    'value': '/emitent/lenzoloto',
  },
  {
    'label': 'Публичное акционерное общество «Федеральная гидрогенерирующая компания - РусГидро», ПАО «РусГидро», HYDR',
    'value': '/emitent/rusgidro',
  },
  {'label': 'Публичное акционерное общество «Ковровский механический завод», ПАО «КМЗ», KMEZ', 'value': '/emitent/kmz'},
  {'label': 'Открытое акционерное общество «ГАЗ-Тек», ОАО «ГАЗ-Тек», GAZT', 'value': '/emitent/gaz-tek'},
  {
    'label': 'Публичное акционерное общество Группа компаний «ТНС энерго», ПАО ГК «ТНС энерго», TNSE',
    'value': '/emitent/tns-energo',
  },
  {
    'label': 'Публичное акционерное общество «Саратовский нефтеперерабатывающий завод», ПАО «Саратовский НПЗ», KRKN, KRKNP',
    'value': '/emitent/saratovskij-npz',
  },
  {'label': 'Публичное акционерное общество «Транснефть», ПАО «Транснефть», TRNFP', 'value': '/emitent/transneft'},
  {
    'label': 'Акционерный Коммерческий банк «АВАНГАРД» — публичное акционерное общество, ПАО АКБ «АВАНГАРД», AVAN',
    'value': '/emitent/avangard',
  },
  {
    'label': 'Публичное акционерное общество «Астраханская энергосбытовая компания», ПАО «Астраханская энергосбытовая компания», ASSB',
    'value': '/emitent/astrahanskaya-energosbytovaya-kompaniya',
  },
  {
    'label': 'Публичное акционерное общество «Вторая генерирующая компания оптового рынка электроэнергии», ПАО «ОГК-2», OGKB',
    'value': '/emitent/ogk-2',
  },
  {'label': 'Публичное акционерное общество «Единые Техно Системы», ПАО «ЕТС», UTSY', 'value': '/emitent/ets'},
  {
    'label': 'Публичное акционерное общество «ИНВЕСТ-ДЕВЕЛОПМЕНТ», ПАО «ИНВЕСТ-ДЕВЕЛОПМЕНТ», IDVP',
    'value': '/emitent/invest-development',
  },
  {'label': 'Открытое акционерное общество «ГАЗ-сервис», ОАО «ГАЗ-сервис», GAZS', 'value': '/emitent/gaz-servis'},
  {
    'label': 'Публичное акционерное общество «Горно-металлургическая компания „Норильский никель“», ПАО «ГМК „Норильский никель“», GMKN',
    'value': '/emitent/norilsk-nikel',
  },
  {
    'label': 'Публичное акционерное общество «ТНС энерго Воронеж», ПАО «ТНС энерго Воронеж», VRSB, VRSBP',
    'value': '/emitent/tns-energo-voronezh',
  },
  {
    'label': 'Публичное акционерное общество «Тамбовская энергосбытовая компания», ПАО «Тамбовская энергосбытовая компания», TASBP, TASB',
    'value': '/emitent/tambovskaya-energosbytovaya-kompaniya',
  },
  {
    'label': 'Публичное акционерное общество «Научно-производственная корпорация „Объединенная Вагонная Компания“», ПАО «НПК ОВК», UWGN',
    'value': '/emitent/npk-ovk',
  },
  {
    'label': 'Открытое акционерное общество «Научно-производственное объединение „Физика“», ОАО НПО «Физика» , NPOF',
    'value': '/emitent/fizika',
  },
  {
    'label': 'Публичное акционерное общество «Межрегиональная распределительная сетевая компания Северо-Запада», ПАО «МРСК Северо-Запада», MRKZ',
    'value': '/emitent/mrsk-severo-zapada',
  },
  {
    'label': 'Публичное акционерное общество «Межрегиональная распределительная сетевая компания Северного Кавказа», ПАО «МРСК Северного Кавказа», MRKK',
    'value': '/emitent/mrsk-severnogo-kavkaza',
  },
  {
    'label': 'Публичное Акционерное Общество «Сибирский гостинец», ПАО «Сибирский гостинец», SIBG',
    'value': '/emitent/sibirskij-gostinec',
  },
  {
    'label': 'Публичное акционерное общество «Кузбасская Топливная Компания», ПАО «КТК», KBTK',
    'value': '/emitent/kuzbasskaya-toplivnaya-kompaniya',
  },
  {
    'label': 'Публичное акционерное общество «Костромская сбытовая компания», ПАО «Костромская сбытовая компания», ПАО «КСК», KTSBP, KTSB',
    'value': '/emitent/kostromskaya-sbytovaya-kompaniya',
  },
  {
    'label': 'Иркутское публичное акционерное общество энергетики и электрификации, ПАО «Иркутскэнерго», IRGZ',
    'value': '/emitent/irkutskenergo',
  },
  {'label': 'Публичное акционерное общество «Кокс», ПАО «Кокс», KSGR', 'value': '/emitent/koks'},
  {
    'label': 'Polymetal International plc, Polymetal International plc, POLY',
    'value': '/emitent/polymetal-international-plc',
  },
  {
    'label': 'Публичное акционерное общество «Группа Компаний ПИК», ПАО «Группа Компаний ПИК», PIKK',
    'value': '/emitent/gruppa-kompanij-pik',
  },
  {
    'label': 'Публичное акционерное общество «Татнефть» имени В.Д. Шашина, ПАО «Татнефть» им. В.Д. Шашина , TATN, TATNP',
    'value': '/emitent/tatneft',
  },
  {
    'label': 'Публичное акционерное общество «Заволжский моторный завод», ПАО «ЗМЗ», ZMZNP, ZMZN',
    'value': '/emitent/zmz',
  },
  {
    'label': 'Публичное акционерное общество «АЛРОСА-Нюрба», ПАО «АЛРОСА-Нюрба», ALNU',
    'value': '/emitent/alrosa-nyurba',
  },
  {
    'label': 'Публичное акционерное общество «Новороссийский комбинат хлебопродуктов», ПАО «НКХП», NKHP',
    'value': '/emitent/nkhp',
  },
  {
    'label': 'Публичное акционерное общество «Газпром газораспределение Ростов-на-Дону», ПАО «Газпром газораспределение Ростов-на-Дону», RTGZ',
    'value': '/emitent/gazprom-gazoraspredelenie-rostov-na-donu',
  },
  {
    'label': 'Публичное акционерное общество «ГЕОТЕК Сейсморазведка», ПАО «ГЕОТЕК Сейсморазведка», GTSS',
    'value': '/emitent/geotek-sejsmorazvedka',
  },
  {
    'label': 'Публичное акционерное общество «Городские Инновационные Технологии», ПАО «ГИТ», GRNT',
    'value': '/emitent/git',
  },
  {'label': 'Публичное акционерное общество «Фармсинтез», ПАО «Фармсинтез», LIFE', 'value': '/emitent/pharmsintez'},
  {
    'label': 'Публичное акционерное общество «Федеральная сетевая компания Единой энергетической системы», ПАО «ФСК ЕЭС», FEES',
    'value': '/emitent/fsk-ees',
  },
  {'label': 'Публичное акционерное общество «Полюс», ПАО «Полюс», PLZL', 'value': '/emitent/polyus-zoloto'},
  {
    'label': 'Публичное акционерное общество «Московская Биржа ММВБ-РТС», ПАО Московская Биржа, MOEX',
    'value': '/emitent/moskovskaya-birzha',
  },
  {'label': 'Публичное акционерное общество «МН-фонд», ПАО «МН-фонд», MNFD', 'value': '/emitent/mnfond'},
  {
    'label': 'Публичное акционерное общество «Московская городская телефонная сеть», ПАО «МГТС», MGTSP, MGTS',
    'value': '/emitent/mgts',
  },
  {
    'label': 'Публичное акционерное общество «Корпорация ВСМПО-АВИСМА», ПАО «Корпорация ВСМПО-АВИСМА», VSMO',
    'value': '/emitent/vsmpo-avisma',
  },
  {'label': 'Публичное акционерное общество «Белуга Групп», ПАО «Белуга Групп», BELU', 'value': '/emitent/sinergiya'},
  {
    'label': 'Акционерный коммерческий банк «Приморье» (публичное акционерное общество), ПАО АКБ «Приморье», PRMB',
    'value': '/emitent/primore',
  },
  {
    'label': 'Публичное акционерное общество «Территориальная генерирующая компания №1», ПАО «ТГК-1», TGKA',
    'value': '/emitent/tgk-1',
  },
  {
    'label': 'Публичное акционерное общество энергетики и электрификации «Сахалинэнерго», ПАО «Сахалинэнерго», SLEN',
    'value': '/emitent/sakhener',
  },
  {
    'label': 'Публичное акционерное общество «РН-Западная Сибирь», ПАО «РН-Западная Сибирь», CHGZ',
    'value': '/emitent/chernogorneft',
  },
  {
    'label': 'Публичное акционерное общество «КуйбышевАзот», ПАО «КуйбышевАзот», KAZTP, KAZT',
    'value': '/emitent/kuibyshevazot',
  },
  {
    'label': '«МОСКОВСКИЙ КРЕДИТНЫЙ БАНК» (публичное акционерное общество), ПАО «МОСКОВСКИЙ КРЕДИТНЫЙ БАНК», CBOM',
    'value': '/emitent/moskovskij-kreditnyj-bank',
  },
  {'label': 'Публичное акционерное общество «Обувь России», ПАО «ОР», OBUV', 'value': '/emitent/obuv-rossii'},
  {'label': 'Публичное акционерное общество «Детский мир», ПАО «Детский мир», DSKY', 'value': '/emitent/detskiy-mir'},
  {'label': 'Публичное акционерное общество «ГЛОБАЛТРАК МЕНЕДЖМЕНТ», ПАО «ГТМ», GTRK', 'value': '/emitent/globaltruck'},
  {'label': 'En+ Group plc, En+ Group plc, ENPL', 'value': '/emitent/en-plus'},
  {
    'label': 'Публичное Акционерное общество  Нефтегазовая компания «РуссНефть», ПАО НК «РуссНефть», RNFT',
    'value': '/emitent/russneft',
  },
  {
    'label': 'Публичное акционерное общество «Сургутнефтегаз», ПАО «Сургутнефтегаз», SNGS, SNGSP',
    'value': '/emitent/surgutneftegaz',
  },
  {
    'label': 'Публичное акционерное общество «Краснокамский завод металлических сеток», ПАО «КЗМС», KZMS',
    'value': '/emitent/kzms',
  },
  {'label': 'Публичное акционерное общество «ТрансФин-М», ПАО «ТрансФин-М», TRFM', 'value': '/emitent/transfin-m'},
  {
    'label': 'Публичное акционерное общество «Якутская топливно-энергетическая компания», ПАО «ЯТЭК», YAKG',
    'value': '/emitent/yatek',
  },
]

let id = 0

export default {
  _embedded: {
    issuers: [
      {
        id: ++id,
        name: 'Министерство Финансов Российской Федерации',
        type: 'state',
      },
      {
        id: ++id,
        name: 'Центральный Банк Российской Федерации',
        type: 'state',
      },
      {
        id: ++id,
        name: 'РЖД',
        type: 'corporate',
      },
    ]
      .concat(
        conomy
          .map(
            ({label}) => label
              .split(', ')
              .filter(p => p.indexOf(' ') !== -1 || p.length > 4)
              .join(', '),
          )
          .map(name => ({
            id: ++id,
            name,
            type: 'corporate',
          })),
      ),
  },
}
